v2206/MSc_icedAirfoil/Meshing_ice_1_v2/+05deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47186;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47210;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47234;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47282;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23562;
        startFace       47330;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23562;
        startFace       70892;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          745;
        startFace       94454;
    }
)

// ************************************************************************* //
